In [ ]:
# Importing from a CSV file
import pandas as pd
data = pd.read_csv(r"C:\Ravi\Python\DataScience\Pandas\Employees.csv",index_col="Empname")
print(data)

           Empid       City State Dept         DOB   Salary
Empname
Keerthi S   1001  Bangalore    KA   IT  01-02-1999   800000
Manasa K    1002  Hyderabad    TN   HR  01-01-2002   600000
Manish R    1003  Hyderabad    TN   FI  01-08-2003   700000
Sanish D    1004  Bangalore    KA   IT  01-01-2004  1000000
Trivesh K   1005  Bangalore    KA   IT  01-11-1998  1000000
Ajay  R     1006  Bangalore    KA   IT  01-11-1998  1200000
Sarath K    1007  Bangalore    KA   IT  01-11-1995  1600000
Sandhya K   1008  Hyderabad    TN   HR  01-01-2004   600000
Binay R     1009  Bangalore    KA   IT  01-11-1996  1400000
Kavitha     1010  Bangalore    KA   HR  01-11-1993   400000

In [2]:
# All rows specific columns

print(data[["Empid","Salary"]])

           Empid   Salary
Empname
Keerthi S   1001   800000
Manasa K    1002   600000
Manish R    1003   700000
Sanish D    1004  1000000
Trivesh K   1005  1000000
Ajay  R     1006  1200000
Sarath K    1007  1600000
Sandhya K   1008   600000
Binay R     1009  1400000
Kavitha     1010   400000

In [ ]:
# Specific rows and specific columns
rows = data.loc[[ "Manasa K"],["Salary","Dept"]]
print(rows)

          Salary Dept
Empname
Manasa K  600000   HR

In [21]:
# iloc - index location
rows = data.iloc[[0,3],[0,3]]
print(rows)

           Empid Dept
Empname
Keerthi S   1001   IT
Sanish D    1004   IT

In [23]:
# Data head and tail methods 
print(data.head())
print(data.tail())

           Empid       City State Dept         DOB   Salary
Empname
Keerthi S   1001  Bangalore    KA   IT  01-02-1999   800000
Manasa K    1002  Hyderabad    TN   HR  01-01-2002   600000
Manish R    1003  Hyderabad    TN   FI  01-08-2003   700000
Sanish D    1004  Bangalore    KA   IT  01-01-2004  1000000
Trivesh K   1005  Bangalore    KA   IT  01-11-1998  1000000
           Empid       City State Dept         DOB   Salary
Empname
Ajay  R     1006  Bangalore    KA   IT  01-11-1998  1200000
Sarath K    1007  Bangalore    KA   IT  01-11-1995  1600000
Sandhya K   1008  Hyderabad    TN   HR  01-01-2004   600000
Binay R     1009  Bangalore    KA   IT  01-11-1996  1400000
Kavitha     1010  Bangalore    KA   HR  01-11-1993   400000

In [25]:
# Query data frame 
# print employees with salary > 600000 and city as Bangalore
res = data.query("Salary > 600000 and City == 'Bangalore'")
print(res)

           Empid       City State Dept         DOB   Salary
Empname
Keerthi S   1001  Bangalore    KA   IT  01-02-1999   800000
Sanish D    1004  Bangalore    KA   IT  01-01-2004  1000000
Trivesh K   1005  Bangalore    KA   IT  01-11-1998  1000000
Ajay  R     1006  Bangalore    KA   IT  01-11-1998  1200000
Sarath K    1007  Bangalore    KA   IT  01-11-1995  1600000
Binay R     1009  Bangalore    KA   IT  01-11-1996  1400000

In [30]:
# concatinating two dataframes 
data1 = {'Name': ['Kiran', 'Keerthi', 'Mohit' ],
        'Age': [25, 30, 22 ],
        'Gender': ['Male', 'Female', 'Male' ],
        'Salary': [50000, 55000, 40000 ]}

data2 = {'Name': ['Kumar', 'Raj' ],
        'Age': [26, 31],
        'Gender': ['Male', 'Male' ],
        'Salary': [45000, 65000]}

df1 = pd.DataFrame (data1)
df2 = pd.DataFrame(data2)
# Before concatenate 
print(df1,'\n\n',df2)

#after concatenate 
frame = [df1,df2]
df_concat = pd.concat(frame)
print(df_concat)

      Name  Age  Gender  Salary
0    Kiran   25    Male   50000
1  Keerthi   30  Female   55000
2    Mohit   22    Male   40000

     Name  Age Gender  Salary
0  Kumar   26   Male   45000
1    Raj   31   Male   65000
      Name  Age  Gender  Salary
0    Kiran   25    Male   50000
1  Keerthi   30  Female   55000
2    Mohit   22    Male   40000
0    Kumar   26    Male   45000
1      Raj   31    Male   65000

In [ ]:
# Concatenate data frames 
data1 = {'Name': ['Kiran', 'Keerthi', 'Mohit' ],
        'Age': [25, 30, 22 ],
        'Gender': ['Male', 'Female', 'Male' ],
        'Salary': [50000, 55000, 40000 ]}

data2 = {'Name': ['Kiran', 'Keerthi' ],
        'Age': [25, 30],
        'Dept': ['IT', 'HR' ]}

df1 = pd.DataFrame (data1)
df2 = pd.DataFrame(data2)
# Before concatenate 
print(df1,'\n\n',df2)

#after concatenate 
frame = [df1,df2]
df_concat = pd.concat(frame)
print(df_concat)

      Name  Age  Gender  Salary
0    Kiran   25    Male   50000
1  Keerthi   30  Female   55000
2    Mohit   22    Male   40000

       Name  Age Dept
0    Kiran   25   IT
1  Keerthi   30   HR
      Name  Age  Gender   Salary Dept
0    Kiran   25    Male  50000.0  NaN
1  Keerthi   30  Female  55000.0  NaN
2    Mohit   22    Male  40000.0  NaN
0    Kiran   25     NaN      NaN   IT
1  Keerthi   30     NaN      NaN   HR

In [32]:
# Merging  data frames 
data1 = {'Name': ['Kiran', 'Keerthi', 'Mohit' ],
        'Age': [25, 30, 22 ],
        'Gender': ['Male', 'Female', 'Male' ],
        'Salary': [50000, 55000, 40000 ]}

data2 = {'Name': ['Kiran', 'Keerthi' ],
        'Age': [25, 30],
        'Dept': ['IT', 'HR' ]}

df1 = pd.DataFrame (data1)
df2 = pd.DataFrame(data2)
# Before concatenate 
print(df1,'\n\n',df2)

# MErging 
df_merge = pd.merge(df1,df2,on="Name")
print(df_merge)

      Name  Age  Gender  Salary
0    Kiran   25    Male   50000
1  Keerthi   30  Female   55000
2    Mohit   22    Male   40000

       Name  Age Dept
0    Kiran   25   IT
1  Keerthi   30   HR
      Name  Age_x  Gender  Salary  Age_y Dept
0    Kiran     25    Male   50000     25   IT
1  Keerthi     30  Female   55000     30   HR

In [35]:
# Merging using Left /right outer join 

data1 = {'Name': ['Kiran', 'Keerthi', 'Mohit' ],
        'Age': [25, 30, 22 ],
        'Gender': ['Male', 'Female', 'Male' ],
        'Salary': [50000, 55000, 40000 ]}

data2 = {'Name': ['Kiran', 'Keerthi','Sita' ],
        'Age': [25, 30,38],
        'Dept': ['IT', 'HR','FI' ]}

df1 = pd.DataFrame (data1)
df2 = pd.DataFrame(data2)
# Before concatenate 
print(df1,'\n\n',df2)

# MErging using left outer join
df_merge = pd.merge(df1,df2,how = 'left',on="Name")
print(df_merge)

# MErging using right outer join
df_merge = pd.merge(df1,df2,how = 'right',on="Name")
print(df_merge)

      Name  Age  Gender  Salary
0    Kiran   25    Male   50000
1  Keerthi   30  Female   55000
2    Mohit   22    Male   40000

       Name  Age Dept
0    Kiran   25   IT
1  Keerthi   30   HR
2     Sita   38   FI
      Name  Age_x  Gender  Salary  Age_y Dept
0    Kiran     25    Male   50000   25.0   IT
1  Keerthi     30  Female   55000   30.0   HR
2    Mohit     22    Male   40000    NaN  NaN
      Name  Age_x  Gender   Salary  Age_y Dept
0    Kiran   25.0    Male  50000.0     25   IT
1  Keerthi   30.0  Female  55000.0     30   HR
2     Sita    NaN     NaN      NaN     38   FI

In [37]:
#  Sorting data frame 
data1 = {'Name': ['Kiran', 'Keerthi', 'Mohit' ],
        'Age': [25, 30, 22 ],
        'Gender': ['Male', 'Female', 'Male' ],
        'Salary': [50000, 55000, 40000 ]}

df = pd.DataFrame(data1)
sorted_df = df.sort_values(by = "Age",ascending=False)
print(sorted_df)

      Name  Age  Gender  Salary
1  Keerthi   30  Female   55000
0    Kiran   25    Male   50000
2    Mohit   22    Male   40000